# **series**

to convert list,numpy array ,dictionary to series

In [ ]:


import numpy as np
import pandas as pd

In [ ]:
ls=[1,2,3]
label=['a','b','c']
arr=np.array([1,2,3])
d={'a':1,'b':2,'c':3}

In [ ]:
pd.Series(data=ls)

0    1
1    2
2    3
dtype: int64

In [ ]:
pd.Series(data=ls,index=label)

a    1
b    2
c    3
dtype: int64

In [ ]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int64

#dictonary

In [ ]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

#create two series and add

In [ ]:
s1=pd.Series([3,5,2],index=['red','blue','green'])

s1

red      3
blue     5
green    2
dtype: int64

In [ ]:
s2=pd.Series([3,7,2],index=['violet','blue','green'])
s2

violet    3
blue      7
green     2
dtype: int64

In [ ]:
s1+s2

blue      12.0
green      4.0
red        NaN
violet     NaN
dtype: float64

#data frames

In [ ]:
from numpy.random import randn
np.random.seed(101)

In [ ]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='H I J K'.split())
df

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

selectiON AND INDEXING

In [ ]:
df['K']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: K, dtype: float64

In [ ]:
df[['I','H']]

          I         H
A  0.628133  2.706850
B -0.319318  0.651118
C  0.740122 -2.018168
D -0.758872  0.188695
E  1.978757  0.190794

CREATE A NEW COLUMN

In [ ]:
df['new']=df['H']+df['J']
df

          H         I         J         K       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

droping the column

In [ ]:
df.drop("new",axis=1,inplace=True)

In [ ]:
df

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop("A")

          H         I         J         K
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

selecting row

In [ ]:
df.loc['B']

H    0.651118
I   -0.319318
J   -0.848077
K    0.605965
Name: B, dtype: float64

In [ ]:
df.iloc[0]

H    2.706850
I    0.628133
J    0.907969
K    0.503826
Name: A, dtype: float64

In [ ]:
df.loc['B','H']

0.6511179479432686

selecting more than one rows

In [ ]:
df.loc[['B','C'],['H','J']]

          H         J
B  0.651118 -0.848077
C -2.018168  0.528813

conditional selection

In [ ]:
df

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df>0]

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['I']>0]

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['I']>0]['J']

A    0.907969
C    0.528813
E    2.605967
Name: J, dtype: float64

In [ ]:
df[df['I']>0]['J'],['H']

(A    0.907969
 C    0.528813
 E    2.605967
 Name: J, dtype: float64, ['H'])

In [ ]:
df[(df['I']>0) & (df['H']>0)]

          H         I         J         K
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

#**operations**

In [ ]:
df=pd.DataFrame({'c1':[1,2,3,4,5], 'c2':[444,555,666,777,444],'c3':['abc','def','gcd','lmc','mfo']})

In [ ]:
df

   c1   c2   c3
0   1  444  abc
1   2  555  def
2   3  666  gcd
3   4  777  lmc
4   5  444  mfo

In [ ]:
df['c2'].unique()

array([444, 555, 666, 777])

In [ ]:
df['c2'].value_counts()

444    2
555    1
666    1
777    1
Name: c2, dtype: int64

selecting data

In [ ]:
a=df[(df['c1']>1) & (df['c2']>555)]
a

   c1   c2   c3
2   3  666  gcd
3   4  777  lmc

applying functions

In [ ]:
def times(x):
  return x*2

In [ ]:
df['c1'].apply(times)

0     2
1     4
2     6
3     8
4    10
Name: c1, dtype: int64

In [ ]:
df['c3'].apply(len)

0    3
1    3
2    3
3    3
4    3
Name: c3, dtype: int64

In [ ]:
df['c1'].sum()

15

In [ ]:
del df['c3']

In [ ]:
df

   c1   c2
0   1  444
1   2  555
2   3  666
3   4  777
4   5  444

In [ ]:
df.columns

Index(['c1', 'c2'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.sort_values(by='c2') #inplace=false by default (permently delete inplace=True )

   c1   c2
0   1  444
4   5  444
1   2  555
2   3  666
3   4  777

In [ ]:
df.sort_values(by='c2',inplace=True)

In [ ]:
df

   c1   c2
0   1  444
4   5  444
1   2  555
2   3  666
3   4  777

In [ ]:
df.isnull()

      c1     c2
0  False  False
4  False  False
1  False  False
2  False  False
3  False  False

DATA input AND **OUTPUT**